DS-2002: Data Project 1

Nathan Geng (nyg5wvz)

Performing ETL on Sakila database

Importing Libraries:

In [1]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

Connecting to MongoDB Server and MySQL

In [2]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
host_name = "localhost"

atlas_cluster_name = "Cluster0"
atlas_user_name = "NathanGeng"
atlas_password = "219675Ng!"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://NathanGeng:219675Ng!@cluster0.sdyc3sy.mongodb.net/"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://NathanGeng:219675Ng!@cluster0.sdyc3sy.mongodb.net/

In [3]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    client = pymongo.MongoClient(connect_str)
    
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, host_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

Populating with Source Data

In [4]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"actors" : 'sakila_actor.json',
              "film_actors" : 'sakila_film_actor.json',
              "film" : 'sakila_film.json',
              "payment" : 'sakila_payment.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        
client.close()

1. Creating/Populating New Dimension Tables

1.1 Extraction from Source MongoDB Collection into Dataframes

In [5]:
query = {}
collection = "actors"

df_actors = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_actors.head(5)

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [6]:
query = {}
collection = "film_actors"

df_film_actors = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_film_actors.head(5)

   actor_id  film_id          last_update
0         1        1  2006-02-15 05:05:03
1         1       23  2006-02-15 05:05:03
2         1       25  2006-02-15 05:05:03
3         1      106  2006-02-15 05:05:03
4         1      140  2006-02-15 05:05:03

In [7]:
query = {}
collection = "film"

df_film = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_film.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

1.2: Tranformation of Dataframes

In [8]:
df_actors.drop(columns={"last_update"}, inplace=True)
df_actors.rename(columns={"actor_id":"actor_key"}, inplace=True)
df_actors.head(5)

   actor_key first_name     last_name
0          1   PENELOPE       GUINESS
1          2       NICK      WAHLBERG
2          3         ED         CHASE
3          4   JENNIFER         DAVIS
4          5     JOHNNY  LOLLOBRIGIDA

In [9]:
df_film_actors.drop(columns={"last_update"}, inplace=True)
df_film_actors.rename(columns={"actor_id":"actor_key", "film_id":"film_key"}, inplace=True)
df_film_actors.head(5)

   actor_key  film_key
0          1         1
1          1        23
2          1        25
3          1       106
4          1       140

In [10]:
df_film.drop(columns={"last_update", "special_features", "original_language_id", "replacement_cost", "rental_rate",
                     "rental_duration", "language_id"}, inplace=True)
df_film.rename(columns={"film_id":"film_key"}, inplace=True)
df_film.head(5)

,film_key,title,description,release_year,length,rating
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,48,G
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,50,NC-17
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,117,G
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,130,G

1.3: Loading Dataframes into Data Warehouse

In [11]:
dataframe = df_actors
table_name = 'dim_actors'
primary_key = 'actor_key'
db_operation = "insert"
set_dataframe(mysql_uid, mysql_pwd, dst_dbname, host_name, dataframe, table_name, primary_key, db_operation)

In [12]:
dataframe = df_film
table_name = 'dim_film'
primary_key = 'film_key'
db_operation = "insert"
set_dataframe(mysql_uid, mysql_pwd, dst_dbname, host_name, dataframe, table_name, primary_key, db_operation)

Validate Creation of New Dimension Tables

In [13]:
sql_actors = "SELECT * FROM sakila_dw.dim_actors;"
df_dim_actors = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, sql_actors)
df_dim_actors.head(5)

   actor_key first_name     last_name
0          1   PENELOPE       GUINESS
1          2       NICK      WAHLBERG
2          3         ED         CHASE
3          4   JENNIFER         DAVIS
4          5     JOHNNY  LOLLOBRIGIDA

In [14]:
sql_film = "SELECT * FROM sakila_dw.dim_film;"
df_dim_film = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, dst_dbname, sql_film)
df_dim_film.head(5)

,film_key,title,description,release_year,length,rating
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,48,G
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,50,NC-17
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,117,G
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,130,G

2.0: Creating New Fact Tables

2.1: Get data from tables and transform

In [15]:
sql_actors = "SELECT * FROM sakila.actor;"
df_actors = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, src_dbname, sql_actors)
df_actors.drop(columns={"last_update"}, inplace=True)
df_actors.rename(columns={"actor_id":"actor_key"}, inplace=True)
df_actors.head(2)

   actor_key first_name last_name
0          1   PENELOPE   GUINESS
1          2       NICK  WAHLBERG

In [16]:
sql_film_actors = "SELECT * FROM sakila.film_actor;"
df_film_actors = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, src_dbname, sql_film_actors)
df_film_actors.drop(columns={"last_update"}, inplace=True)
df_film_actors.rename(columns={"actor_id":"actor_key", "film_id":"film_key"}, inplace=True)
df_film_actors.head(2)

   actor_key  film_key
0          1         1
1          1        23

In [17]:
sql_film = "SELECT * FROM sakila.film;"
df_film = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, src_dbname, sql_film)
df_film.drop(columns={"last_update", "special_features", "original_language_id", "replacement_cost", "rental_rate",
                     "rental_duration", "language_id"}, inplace=True)
df_film.rename(columns={"film_id":"film_key"}, inplace=True)
df_film.head(2)

,film_key,title,description,release_year,length,rating
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,48,G

Merging

In [18]:
df_film_actors = pd.merge(df_film_actors, df_film, on='film_key', how='right')
df_film_actors.head(2)

,actor_key,film_key,title,description,release_year,length,rating
0,1.0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG
1,10.0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG

In [19]:
df_fact_actors = pd.merge(df_actors, df_film_actors, on='actor_key', how='right')
df_fact_actors.head(2)

,actor_key,first_name,last_name,film_key,title,description,release_year,length,rating
0,1.0,PENELOPE,GUINESS,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG
1,10.0,CHRISTIAN,GABLE,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG

Implementation of Date Dimension

In [20]:
sql_dim_date = "SELECT date_key, full_date FROM sakila.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

Write the Dataframe back into the Database

In [26]:
table_name = "fact_actors"
primary_key = "film_key"
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, host_name, dataframe, table_name, primary_key, db_operation)

Test that the new data warehouse has been created

In [24]:
sql_test = """
   SELECT actors.`last_name` AS `actor_last_name`,
        SUM(fact_actors.`length`) AS `total_length`
    FROM `{0}`.`fact_actors` AS actors
    GROUP BY `actor_last_name`
    ORDER BY total_length DESC;
""".format(dst_dbname)

df_test = get_sql_dataframe(mysql_uid, mysql_pwd, host_name, src_dbname, sql_test)
df_test.head()

OperationalError: (pymysql.err.OperationalError) (1054, "Unknown column 'actors.last_name' in 'field list'")
[SQL:
   SELECT actors.`last_name` AS `actor_last_name`,
        SUM(fact_actors.`length`) AS `total_length`
    FROM `sakila_dw`.`fact_actors` AS actors
    GROUP BY `actor_last_name`
    ORDER BY total_length DESC;
]
(Background on this error at: https://sqlalche.me/e/14/e3q8)